name: "PRID"
richness: 1000

##################################### data #####################################
layer { name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 100 shuffle_pool_size: 10
    source: "external/exp/db/prid/train_lmdb" }
  transform_param { mirror: true crop_height: 144 crop_width: 56
    mean_value: 102 mean_value: 102 mean_value: 101 }
  include: { phase: TRAIN } }
layer { name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 20
    source: "external/exp/db/prid/val_lmdb" }
  transform_param { mirror: false crop_height: 144 crop_width: 56
    mean_value: 102 mean_value: 102 mean_value: 101 }
  include: { phase: TEST } }

################################ fixed layers ##################################
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv3"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "inception_1a/1x1"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_1x1"
  type: "ReLU"
  bottom: "inception_1a/1x1"
  top: "inception_1a/1x1"
}
layer {
  name: "inception_1a/3x3_reduce"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3_reduce"
}
layer {
  name: "inception_1a/3x3"
  type: "Convolution"
  bottom: "inception_1a/3x3_reduce"
  top: "inception_1a/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_3x3"
  type: "ReLU"
  bottom: "inception_1a/3x3"
  top: "inception_1a/3x3"
}
layer {
  name: "inception_1a/double_3x3_reduce"
  type: "Convolution"
  bottom: "pool1"
  top: "inception_1a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_reduce"
}
layer {
  name: "inception_1a/double_3x3_1"
  type: "Convolution"
  bottom: "inception_1a/double_3x3_reduce"
  top: "inception_1a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_1"
}
layer {
  name: "inception_1a/double_3x3_2"
  type: "Convolution"
  bottom: "inception_1a/double_3x3_1"
  top: "inception_1a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_1a/double_3x3_2"
  top: "inception_1a/double_3x3_2"
}
layer {
  name: "inception_1a/pool"
  type: "Pooling"
  bottom: "pool1"
  top: "inception_1a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_1a/pool_proj"
  type: "Convolution"
  bottom: "inception_1a/pool"
  top: "inception_1a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/pool_proj"
}
layer {
  name: "inception_1a/output"
  type: "Concat"
  bottom: "inception_1a/1x1"
  bottom: "inception_1a/3x3"
  bottom: "inception_1a/double_3x3_2"
  bottom: "inception_1a/pool_proj"
  top: "inception_1a/output"
}
layer {
  name: "inception_1b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_1a/output"
  top: "inception_1b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3_reduce"
}
layer {
  name: "inception_1b/3x3"
  type: "Convolution"
  bottom: "inception_1b/3x3_reduce"
  top: "inception_1b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1b/relu_3x3"
  type: "ReLU"
  bottom: "inception_1b/3x3"
  top: "inception_1b/3x3"
}
layer {
  name: "inception_1b/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_1a/output"
  top: "inception_1b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1b/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_reduce"
}
layer {
  name: "inception_1b/double_3x3_1"
  type: "Convolution"
  bottom: "inception_1b/double_3x3_reduce"
  top: "inception_1b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1b/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_1"
}
layer {
  name: "inception_1b/double_3x3_2"
  type: "Convolution"
  bottom: "inception_1b/double_3x3_1"
  top: "inception_1b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_1b/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_1b/double_3x3_2"
  top: "inception_1b/double_3x3_2"
}
layer {
  name: "inception_1b/pool"
  type: "Pooling"
  bottom: "inception_1a/output"
  top: "inception_1b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_1b/output"
  type: "Concat"
  bottom: "inception_1b/3x3"
  bottom: "inception_1b/double_3x3_2"
  bottom: "inception_1b/pool"
  top: "inception_1b/output"
}
layer {
  name: "inception_2a/1x1"
  type: "Convolution"
  bottom: "inception_1b/output"
  top: "inception_2a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_1x1"
  type: "ReLU"
  bottom: "inception_2a/1x1"
  top: "inception_2a/1x1"
}
layer {
  name: "inception_2a/3x3_reduce"
  type: "Convolution"
  bottom: "inception_1b/output"
  top: "inception_2a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_2a/3x3_reduce"
  top: "inception_2a/3x3_reduce"
}
layer {
  name: "inception_2a/3x3"
  type: "Convolution"
  bottom: "inception_2a/3x3_reduce"
  top: "inception_2a/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_3x3"
  type: "ReLU"
  bottom: "inception_2a/3x3"
  top: "inception_2a/3x3"
}
layer {
  name: "inception_2a/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_1b/output"
  top: "inception_2a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_reduce"
  top: "inception_2a/double_3x3_reduce"
}
layer {
  name: "inception_2a/double_3x3_1"
  type: "Convolution"
  bottom: "inception_2a/double_3x3_reduce"
  top: "inception_2a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_1"
  top: "inception_2a/double_3x3_1"
}
layer {
  name: "inception_2a/double_3x3_2"
  type: "Convolution"
  bottom: "inception_2a/double_3x3_1"
  top: "inception_2a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_2a/double_3x3_2"
  top: "inception_2a/double_3x3_2"
}
layer {
  name: "inception_2a/pool"
  type: "Pooling"
  bottom: "inception_1b/output"
  top: "inception_2a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_2a/pool_proj"
  type: "Convolution"
  bottom: "inception_2a/pool"
  top: "inception_2a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_2a/pool_proj"
  top: "inception_2a/pool_proj"
}
layer {
  name: "inception_2a/output"
  type: "Concat"
  bottom: "inception_2a/1x1"
  bottom: "inception_2a/3x3"
  bottom: "inception_2a/double_3x3_2"
  bottom: "inception_2a/pool_proj"
  top: "inception_2a/output"
}
layer {
  name: "inception_2b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_2a/output"
  top: "inception_2b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_2b/3x3_reduce"
  top: "inception_2b/3x3_reduce"
}
layer {
  name: "inception_2b/3x3"
  type: "Convolution"
  bottom: "inception_2b/3x3_reduce"
  top: "inception_2b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2b/relu_3x3"
  type: "ReLU"
  bottom: "inception_2b/3x3"
  top: "inception_2b/3x3"
}
layer {
  name: "inception_2b/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_2a/output"
  top: "inception_2b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2b/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_reduce"
  top: "inception_2b/double_3x3_reduce"
}
layer {
  name: "inception_2b/double_3x3_1"
  type: "Convolution"
  bottom: "inception_2b/double_3x3_reduce"
  top: "inception_2b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2b/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_1"
  top: "inception_2b/double_3x3_1"
}
layer {
  name: "inception_2b/double_3x3_2"
  type: "Convolution"
  bottom: "inception_2b/double_3x3_1"
  top: "inception_2b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_2b/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_2b/double_3x3_2"
  top: "inception_2b/double_3x3_2"
}
layer {
  name: "inception_2b/pool"
  type: "Pooling"
  bottom: "inception_2a/output"
  top: "inception_2b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_2b/output"
  type: "Concat"
  bottom: "inception_2b/3x3"
  bottom: "inception_2b/double_3x3_2"
  bottom: "inception_2b/pool"
  top: "inception_2b/output"
}
layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "inception_2b/output"
  top: "inception_3a/1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "inception_3a/1x1"
  top: "inception_3a/1x1"
}
layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "inception_2b/output"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3_reduce"
}
layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce"
  top: "inception_3a/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "inception_3a/3x3"
  top: "inception_3a/3x3"
}
layer {
  name: "inception_3a/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_2b/output"
  top: "inception_3a/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_reduce"
  top: "inception_3a/double_3x3_reduce"
}
layer {
  name: "inception_3a/double_3x3_1"
  type: "Convolution"
  bottom: "inception_3a/double_3x3_reduce"
  top: "inception_3a/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_1"
  top: "inception_3a/double_3x3_1"
}
layer {
  name: "inception_3a/double_3x3_2"
  type: "Convolution"
  bottom: "inception_3a/double_3x3_1"
  top: "inception_3a/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_3a/double_3x3_2"
  top: "inception_3a/double_3x3_2"
}
layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "inception_2b/output"
  top: "inception_3a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/pool_proj"
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "inception_3a/1x1"
  bottom: "inception_3a/3x3"
  bottom: "inception_3a/double_3x3_2"
  bottom: "inception_3a/pool_proj"
  top: "inception_3a/output"
}
layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3_reduce"
}
layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce"
  top: "inception_3b/3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "inception_3b/3x3"
  top: "inception_3b/3x3"
}
layer {
  name: "inception_3b/double_3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/double_3x3_reduce"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_double_3x3_reduce"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_reduce"
  top: "inception_3b/double_3x3_reduce"
}
layer {
  name: "inception_3b/double_3x3_1"
  type: "Convolution"
  bottom: "inception_3b/double_3x3_reduce"
  top: "inception_3b/double_3x3_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_double_3x3_1"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_1"
  top: "inception_3b/double_3x3_1"
}
layer {
  name: "inception_3b/double_3x3_2"
  type: "Convolution"
  bottom: "inception_3b/double_3x3_1"
  top: "inception_3b/double_3x3_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_double_3x3_2"
  type: "ReLU"
  bottom: "inception_3b/double_3x3_2"
  top: "inception_3b/double_3x3_2"
}
layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad_h: 0
    pad_w: 1
  }
}
layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "inception_3b/3x3"
  bottom: "inception_3b/double_3x3_2"
  bottom: "inception_3b/pool"
  top: "inception_3b/output"
}
layer {
  name: "global_pool"
  type: "Pooling"
  bottom: "inception_3b/output"
  top: "global_pool"
  pooling_param {
    pool: AVE
    stride: 1
    kernel_h: 9
    kernel_w: 4
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "global_pool"
  top: "fc7"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}

####################################### loss accuracy #######################################
layer { name: "fc8_prid" type: "InnerProduct" bottom: "fc7" top: "fc8_prid"
  param { lr_mult: 1 decay_mult: 1 } param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 385
    weight_filler { type: "gaussian" std: 0.001 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "loss" type: "SoftmaxWithLoss" bottom: "fc8_prid" bottom: "label" top: "loss" }
layer { name: "accuracy" type: "Accuracy" bottom: "fc8_prid" bottom: "label" top: "accuracy"
  include { phase: TEST } }
