name: "CUHK03_VGGNet_BN"


##################################### data #####################################
layer { name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 128
    source: "external/exp/db/cuhk03_split_00/train_lmdb" }
  transform_param { mirror: true crop_height: 144 crop_width: 56
    mean_file: "external/exp/db/cuhk03_split_00/mean.binaryproto" }
  include: { phase: TRAIN } }
layer { name: "data" type: "Data" top: "data" top: "label"
  data_param { backend: LMDB batch_size: 100
    source: "external/exp/db/cuhk03_split_00/val_lmdb" }
  transform_param { mirror: false crop_height: 144 crop_width: 56
    mean_file: "external/exp/db/cuhk03_split_00/mean.binaryproto" }
  include: { phase: TEST } }


################################### network ####################################
layer { name: "conv1_1" type: "Convolution" bottom: "data" top: "conv1_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 32 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.005 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_1_bn" type: "BN" bottom: "conv1_1" top: "conv1_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_1" type: "ReLU" bottom: "conv1_1_bn" top: "conv1_1_bn" }
layer { name: "conv1_2" type: "Convolution" bottom: "conv1_1_bn" top: "conv1_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 32 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_2_bn" type: "BN" bottom: "conv1_2" top: "conv1_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_2" type: "ReLU" bottom: "conv1_2_bn" top: "conv1_2_bn" }
layer { name: "conv1_3" type: "Convolution" bottom: "conv1_2_bn" top: "conv1_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 32 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv1_3_bn" type: "BN" bottom: "conv1_3" top: "conv1_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu1_3" type: "ReLU" bottom: "conv1_3_bn" top: "conv1_3_bn" }
layer { name: "pool1" type: "Pooling" bottom: "conv1_3_bn" top: "pool1"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv2_1" type: "Convolution" bottom: "pool1" top: "conv2_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_1_bn" type: "BN" bottom: "conv2_1" top: "conv2_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_1" type: "ReLU" bottom: "conv2_1_bn" top: "conv2_1_bn" }
layer { name: "conv2_2" type: "Convolution" bottom: "conv2_1_bn" top: "conv2_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_2_bn" type: "BN" bottom: "conv2_2" top: "conv2_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_2" type: "ReLU" bottom: "conv2_2_bn" top: "conv2_2_bn" }
layer { name: "conv2_3" type: "Convolution" bottom: "conv2_2_bn" top: "conv2_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 64 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv2_3_bn" type: "BN" bottom: "conv2_3" top: "conv2_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu2_3" type: "ReLU" bottom: "conv2_3_bn" top: "conv2_3_bn" }
layer { name: "pool2" type: "Pooling" bottom: "conv2_3_bn" top: "pool2"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "conv3_1" type: "Convolution" bottom: "pool2" top: "conv3_1"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_1_bn" type: "BN" bottom: "conv3_1" top: "conv3_1_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_1" type: "ReLU" bottom: "conv3_1_bn" top: "conv3_1_bn" }
layer { name: "conv3_2" type: "Convolution" bottom: "conv3_1_bn" top: "conv3_2"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_2_bn" type: "BN" bottom: "conv3_2" top: "conv3_2_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_2" type: "ReLU" bottom: "conv3_2_bn" top: "conv3_2_bn" }
layer { name: "conv3_3" type: "Convolution" bottom: "conv3_2_bn" top: "conv3_3"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  convolution_param { num_output: 128 kernel_size: 3 stride: 1 pad: 1
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "conv3_3_bn" type: "BN" bottom: "conv3_3" top: "conv3_3_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu3_3" type: "ReLU" bottom: "conv3_3_bn" top: "conv3_3_bn" }
layer { name: "pool3" type: "Pooling" bottom: "conv3_3_bn" top: "pool3"
  pooling_param { pool: MAX kernel_size: 2 stride: 2 } }

layer { name: "fc6" type: "InnerProduct" bottom: "pool3" top: "fc6"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 256
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "fc6_bn" type: "BN" bottom: "fc6" top: "fc6_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu6" type: "ReLU" bottom: "fc6_bn" top: "fc6_bn" }
layer { name: "drop6" type: "Dropout" bottom: "fc6_bn" top: "fc6_bn"
  dropout_param { dropout_ratio: 0.5 } }

layer { name: "fc7" type: "InnerProduct" bottom: "fc6_bn" top: "fc7"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 256
    weight_filler { type: "gaussian" std: 0.05 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "fc7_bn" type: "BN" bottom: "fc7" top: "fc7_bn"
  param { lr_mult: 1 decay_mult: 0 }
  param { lr_mult: 1 decay_mult: 0 }
  bn_param {
    slope_filler { type: "constant" value: 1 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "relu7" type: "ReLU" bottom: "fc7_bn" top: "fc7_bn" }
layer { name: "drop7" type: "Dropout" bottom: "fc7_bn" top: "fc7_bn"
  dropout_param { dropout_ratio: 0.5 } }


################################# fc8 loss acc #################################
layer { name: "fc8_cuhk03" type: "InnerProduct" bottom: "fc7_bn" top: "fc8_cuhk03"
  param { lr_mult: 1 decay_mult: 1 }
  param { lr_mult: 2 decay_mult: 0 }
  inner_product_param { num_output: 1467
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 } } }
layer { name: "accuracy" type: "Accuracy"
  bottom: "fc8_cuhk03" bottom: "label" top: "accuracy"
  include: { phase: TEST } }
layer { name: "loss" type: "SoftmaxWithLoss"
  bottom: "fc8_cuhk03" bottom: "label" top: "loss" }